[
    {
        "article_number": 1,
        "title": "Why is the Western Media so oddly obsessed with why South Korea and Japan are birthless, sexless, and sexist?",
        "url": "https://www.reddit.com/r/aznidentity/comments/1evj9n2/why_is_the_western_media_so_oddly_obsessed_with/",
        "score": "246",
        "comments": "101",
        "body": "Does anyone else find it disgusting? Why are they so obsessed with sex and genitals? Out of all those countries, why do they keep talking about those two countries as needing more babies and needing more sex?\nAlso, do Korean men or Japanese men know the awful stereotypes Westerners have about Asian men but in particular Asian women? How they don't report crime, they are quiet, submissive, don't fight back, Asian women will blame themselves and their societies will victim blame them etc and the disgraceful rise of \"passportbros\"?\nAndrew Schultz went on the Joe Rogan podcast talking about how Asian women having tighter pussies \"for some reason\" *wink* *wink* implying because Asian men are smaller.\nRampage Jackson also went on the Joe Rogan podcast talking about Japan and how they are all sexless there etc and he women there will treat you well and love foreign men etc\nThere was also this clip that went viral of Jiaoying Summers, an Asian female comedian talking about how the best Asian woman to get overseas is from the countryside. Because she will not be polluted by capitalism, will be submissive to you, listen to you, and is more pure and innocent.\nIt's disgusting"
    },
    {
        "article_number": 2,
        "title": "Once again, a western reporter ignores the reactions of the Japanese/Asians regarding the assassin's creed controversy and twists it into some gamergate narrative",
        "url": "https://web.archive.org/web/20240816171641/https://www.wired.com/story/assassins-creed-shadows-dei-gamergate/",
        "score": "136",
        "comments": "8",
        "body": "Body content not found"
    },
    {
        "article_number": 3,
        "title": "Official Olympics Poster from @Eurosport deliberately excluding asians even though China and Japan finished 2nd and 3rd in total medal count.",
        "url": "https://reddit-uploaded-media.s3-accelerate.amazonaws.com/pii0krlhqsid1",
        "score": "133",
        "comments": "23",
        "body": "Body content not found"
    },
    {
        "article_number": 4,
        "title": "Why do white people treat tofu like a meat substitute?",
        "url": "https://www.reddit.com/r/aznidentity/comments/1ex3lba/why_do_white_people_treat_tofu_like_a_meat/",
        "score": "118",
        "comments": "55",
        "body": "The hell do you mean buttermilk fried tofu chicken? This is why people hate white vegans bro, did you just try to hand me a bowl of tofu chili? I’m going to perform a citizens arrest and extradite you to China. Tofu is its own thing, an ingredient with its own identity which should be treated as such. As a cook, very few things piss me off more than westerners trying to make tofu something it’s not when you can just play to tofu’s inherent strengths when building a dish instead of haphazardly making trendy vegan bullshit versions of meat-based dishes. Dishonorable mention goes to meatless mapo tofu that white people make sometimes, that shit sucks."
    },
    {
        "article_number": 5,
        "title": "Korea sees increasing trend of 'reverse migration'",
        "url": "https://www.koreatimes.co.kr/www/nation/2024/08/113_380513.html",
        "score": "115",
        "comments": "51",
        "body": "Body content not found"
    },
    {
        "article_number": 6,
        "title": "Does anyone else think the movie didi is insanely racist towards Asian men?",
        "url": "https://www.reddit.com/r/aznidentity/comments/1evuco3/does_anyone_else_think_the_movie_didi_is_insanely/",
        "score": "61",
        "comments": "35",
        "body": "I saw Didi in theaters with my boyfriend. We both saw the trailer and thought it would be your typical slice of life but with Asians as the protagonists. But towards the middle I noticed something was wrong. They changed the main characters' personality completely and made his some kind of bitter incel. He was super rude to his parents that even his white 'friends' had to call him out on it and they even depicted the father as being absent.\nAfter reading through this sub, I have become painfully aware of how Asian American men are treated and the trailer makes you think its going to be a fun movie but then it ends up being one of the most depressing things you've ever seen.\nI don't like how hollywood will only depict asian men in these weird ways even in movies dedicated for asians.\nDoes anyone know, is it a boba liberal production? From what I can see the director is an asian men so I don't know why he decided to have such a negative portrayal of asians. Even towards the end my boyfriend pointed out that the only person didi committed violence to was the Korean kid which I also thought was a weird choice.\nEDIT: But I just found it weird how it singled out east asian men as being weird loners with no friends, no social skills and are absent from life. There's too much of that in the media already but I found it worse than even the awkward tween stuff. The beginning was awkward angsty tween stuff, what it morphed into was something weirder entirely.\nJust found out the producers were white males which explains alot. Please don't watch the movie, it promotes a certain image of asian men\nEDIT2: After thinking about it, I realized that the whole point of the movie is to single out the Asian character as someone who had something intesely, deeply wrong with HIM. It's not his tween angst because the beginning is about that. Nobody showed him racism (except for a small incident with that girl) and even then his response was to self isolate.\nIt was weird and gave me big incel vibes."
    },
    {
        "article_number": 7,
        "title": "Most of the world should give huge thanks to Asians",
        "url": "https://www.reddit.com/r/aznidentity/comments/1eufo2r/most_of_the_world_should_give_huge_thanks_to/",
        "score": "56",
        "comments": "15",
        "body": "I've been living in eastern europe for more than 3 decades, and even though I am not asian american, I would like to share some of my experiences I felt as an asian owner operating several shops in large cities.\nIn the 90s, most products were so ridiculously overpriced, that the majority of people couldn't afford to buy things from the west (1 nike t-shirt was $100 not accounting for inflation). Asian hatred was on a whole other level back then, people one time spat on me out of nowhere or punched me in my face.\nI had one loyal customer who was initially hostile to me, but after several years he apologized to me for being rude. He said that thanks to us, he was able to afford things he otherwise couldn't have bought, and it helped him get through hard times. (he passed away unfortunately, rip and thank you)\nAs of now, Chinese companies like Xiaomi and Byd received backlash from several european manufacturers saying that they are killing companies there. It might sound harsh from my side, but when 70% of the population just makes ends meet, especially in poorer countries, what does advancements in technology matter when it's inaccessible to the public? Who cares about the next Nasa mission on Mars when people can't afford basic food and rent every month? Since asian companies went to Europe, for example in my country, tesla car prices went down 20%, and there is no way they wanted to do that. They did because we forced them to. People are now using Samsung and Xiaomi phones, because people gradually realize that Iphones are way too overpriced. People don't realize that almost every basic neccesity that they take for granted today is cheap mainly because of the pressure from asian companies to push prices down. The western world is way too spoiled. (Volkswagen car in China is 18k, in Europe 40k, like what the actual fuck)\nI'm not saying that all white people are bad, I have just as many white friends who are kind and friendly, but the system embedded natural racism so much in Europe, due to colonial history, that the society doesn't even recognize that racism is a problem. While the compliments by the minority were rare, this was the reason why I didn't break down emotionally and kept going on. I still have faith that proper education can vastly improve on the situation.\nTo the fellow asians, who experienced the same thing, while racism back then also hurted me deep to my core, it humbled me, and made me grateful for what I am, and truly made me understand that good things can't be truly enjoyed without experiencing the opposite. I hope that in the future, asians will get recognition what we've done to the world, and not view it negatively.\nIf you've read this far, thank you very much for your time to read it, and wish you a very nice day!"
    },
    {
        "article_number": 8,
        "title": "Why do large Asian Youtube influencers think it's okay to proliferate negative Asian stereotypes, while claiming defense under the banner of \"self-deprecating humor\". Should be obvious this isn't okay.",
        "url": "https://www.youtube.com/watch?v=0a6cvG22Ng4",
        "score": "50",
        "comments": "33",
        "body": "Body content not found"
    },
    {
        "article_number": 9,
        "title": "What is your favorite Asian You Tube channel for entertainment and news?",
        "url": "https://www.reddit.com/r/aznidentity/comments/1etwsuj/what_is_your_favorite_asian_you_tube_channel_for/",
        "score": "44",
        "comments": "37",
        "body": "Some individuals may have a preference for Fung Bros., however, I personally do not find their content particularly appealing. I have some concerns about the way they differentiate between ABCs and FOBs based solely on their geographic locations. Additionally, they occasionally make remarks suggesting that they are superior to their parents due to their greater familiarity with Western society compared to their parents' life experiences. Furthermore, in a video they created nine years ago, they made fun of their height compared to white males and suggested that white males have a preference for Asian women.\nIn contrast, I find Hanswhy's channel to be both informative and inspiring, especially when it comes to Asian stories. While some may find his accent to be a deterrent, I personally find it to be distinctive and genuine. He shares his personal experiences from his youth and encourages others to stand up for themselves, even when our parents advise us to avoid trouble and stay out of situations where non-Asians initiate conflict."
    },
    {
        "article_number": 10,
        "title": "Asian Americans, Asians, and PoC, should re-evaluate 'non-existent white culture's' trojan horse claim of being the most humane, and the most benign.",
        "url": "https://www.reddit.com/r/aznidentity/comments/1eurj0d/asian_americans_asians_and_poc_should_reevaluate/",
        "score": "43",
        "comments": "3",
        "body": "A lot of Asians, and Asian-Americans, think, 1.Asians and PoC should partially assimilate to 'non-existent white culture' as some sort of upgrade or mandatory action, and, 2.Some think white culture is benign.\nIf you looked at the republican convention, you saw a conservative with a forehead tattoo, talking on stage, about all kinds of liberal-lite degeneracy being proposed. If you looked at the Paris opening ceremony, you saw something grotesque.  That behavior is meant for white people, and quite frankly, for golden retrievers. When you watch Jerry Springer, you think, that's for white people. When you see people that think WWE is real, that's for white people. When you see real wrestling, it's a crowd of men, watching two disgustingly sweaty people in skin tight suits, trying to disgustingly introduce every part of their body on every part of their opponent's body, while trying to forcefully pin down another man. That's for white people.\nWhat kind of upgrade is partially assimilating to those people? Again, how harmless, is being in close contact with 'non-existent white culture', that's main goals are chaotic debauchery, and organized debauchery?\nYou are not safe being around them without your guard up, and, should not partially assimilate to such an abomination.  Honestly, I think, at worst, they are grotesque, at their best, they are contemptable."
    },
    {
        "article_number": 11,
        "title": "The selection of 'Asian-American integration', or 'Asian-American assimilation' determines long term success, or, stagnation. How well do you comprehend, those, often misunderstood concepts?",
        "url": "https://www.reddit.com/r/aznidentity/comments/1ewdogt/the_selection_of_asianamerican_integration_or/",
        "score": "40",
        "comments": "17",
        "body": "The conflation of the concept of integration, and assimilation, is often the case with Asian-Americans, and of most people. It's critical that you know the difference.  Below is an explanation of each concept, and the outcome of each tactic.\nAssimilation is the eradication of one's culture. To be replaced, often times, with the majority's culture, that, is on average, less productive, and maligned with the interest of the sub-group.  It might be the right culture for the majority culture, who knows, but, it was emergently developed, specifically, for the majority culture. It's equivalent to wearing someone else's bespoke fit jacket, instead, of making your own bespoke jacket. It's a maladapted culture for the Asian-American community's circumstance.\nIntegration, on the other hand, is to have a distinctive culture, that is adapted to the local circumstance. So to be compatible with the majority culture, while also serving the interest of sustaining and furthering the sub-group, and also others(by virtue of superior value creation than the majority in a few particular aspects) that are outside of the sub-group(as means for fair play).\nIf you have been paying attention. Assimilation, is a scheme, foisted by the majority group(and perpetrated by  non-discerning Asian Americans), to groom the Asian American sub-group for exploitation.  Why the majority behaves like that, rather than create immense value, and facilitate fair play, who knows? Integration is to take control of one's ownership of their own minority community, and sustain and adapt. So to create immense value(and benefit from that value), and safety.\nRecap.\nChoose integration of a distinct sub-culture(into the local and national environment) that has distinctive specialized competencies not readily found in the majority community. So to be an 'indispensable pivotal community'.\nDo not assimilation to the majority culture, and utilize a generic strategy that is only suited to the majority group.\nTwo seemingly similar concept. Two diametrically opposed outcomes."
    },
    {
        "article_number": 12,
        "title": "An update on the cultural appropriation question",
        "url": "https://www.reddit.com/r/aznidentity/comments/1ex3buk/an_update_on_the_cultural_appropriation_question/",
        "score": "36",
        "comments": "6",
        "body": "It turns out Megan isn't as much of an ally as we thought. In her song “no heart”. She says “Eyes so low like I'm Sue Call me ching chong” I hate to say \"I told you so,\" but I had a feeling this would happen. The video she made didn't come across as genuinely interested or respectful. It felt more opportunistic and exploitive. I love anime and am mixed Asian myself, but I would never exploit Japanese culture just because I enjoy anime.\nIt's like saying, \"I liked Rush Hour, so I'm going to wear qipaos for the rest of my life and profit off exploiting Chinese culture.\" This defense misses the point and shows a lack of genuine respect for the culture. I’m wondering if she will release a statement apologising for her past lyrics or just sweep it under the rug. Before this fiasco, I’ve seen a lot of netizens on xiaohongshu hated the MV, despite a lot of AA(Asian Americans) loving it.\nOriginal post:\nhttps://www.reddit.com/r/aznidentity/s/otHAkcXmAI\n(Sorry if this post isn’t welcome here, I unfortunately cannot resist to scratch the itch that is “I told you so”😂😣)"
    },
    {
        "article_number": 13,
        "title": "Propaganda against Asian men",
        "url": "https://vt.tiktok.com/ZS2Ns2HLt/",
        "score": "34",
        "comments": "26",
        "body": "Body content not found"
    },
    {
        "article_number": 14,
        "title": "I still support AZN identity community and you're all awesome. I'm in process of getting my first sponsorship",
        "url": "https://youtu.be/sczbqr_4Euw",
        "score": "33",
        "comments": "0",
        "body": "Body content not found"
    },
    {
        "article_number": 15,
        "title": "The Umbrella Academy Season 4",
        "url": "https://www.reddit.com/r/aznidentity/comments/1euqg29/the_umbrella_academy_season_4/",
        "score": "28",
        "comments": "2",
        "body": "I am pleasantly surprised at how many lines Ben gets in this season. Also a love interest that is also Asian! Love to see it!"
    },
    {
        "article_number": 16,
        "title": "Moving from Canada to Europe as an Asian Male: What Should I Expect?",
        "url": "https://www.reddit.com/r/aznidentity/comments/1exl9w0/moving_from_canada_to_europe_as_an_asian_male/",
        "score": "7",
        "comments": "13",
        "body": "Hey everyone,\nI’m an Asian male (30) who’s about to move from Canada to France (not Paris), and I’m feeling a bit uncertain about what to expect. I’ve spent the last 7 years in Canada, where I found it challenging to make deep, meaningful friendships. While I didn’t face any overt racism, I often felt that the connections I made were somewhat surface-level.\nNow, as I prepare to move to a smaller community in France, I’m concerned about how I’ll be perceived as a non-white person. Will it be even harder to connect with people? Should I be worried about experiencing racism or being excluded?\nFor those of you who have lived in both Canada and Europe as an Asian male, what were your experiences like? Did you find it easier or harder to build relationships? Were people more or less welcoming? I’m particularly interested in hearing about life outside of major cities.\nI’d appreciate any advice or insights you might have!\nThanks!"
    },
    {
        "article_number": 17,
        "title": "Advice for dating FOBs",
        "url": "https://www.reddit.com/r/aznidentity/comments/1esr5is/advice_for_dating_fobs/",
        "score": "0",
        "comments": "17",
        "body": "I’m an ABC that has mostly talked to/dated other American born Asians. I’ve started using dating apps recently and many of my apps are with FOBs typically from China or Korea.\nI feel like a lot of the flirting I usually do doesn’t translate as well and there’s a cultural divide despite me not being very whitewashed. Any tips or insight would be appreciated!"
    },
    {
        "article_number": 18,
        "title": "Any gay Asian bros that can comment on our sexual and beauty appeal? Are Asian men still at the bottom of the hierarchy?",
        "url": "https://www.reddit.com/r/aznidentity/comments/1esnys1/any_gay_asian_bros_that_can_comment_on_our_sexual/",
        "score": "0",
        "comments": "15",
        "body": "Can anyone tell? Thanks"
    }
]